# Соотнесите методы словарей с их действием.
# Match the methods of dictionaries with their actions.

get() --- получает значение в словаре по ключу
update() --- объединяет словари
pop() --- возвращает значение по указанному ключу, удаляя из словаря пару (ключ, значение)
popitem() --- возвращает последнюю добавленную пару (ключ, значение), удаляя её из словаря
clear() --- удаляет все элементы из словаря
copy() --- создает копию словаря
items() --- возвращает элементы словаря в виде пар (ключ, значение)
keys() --- возвращает список ключей словаря
values() --- возвращает список значений словаря
