# Number of different symbols
# A line of text is given as input to the program. Write a program that determines the number of distinct characters in a string.

# Количество различных символов
# На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в строке.

print(len(set(input())))

# Sample Input 1:
# 12345678910
# Sample Output 1:
# 10
# Sample Input 2:
# ab bc
# Sample Output 2:
# 4
